
# 1.1--------------------------------------------------------------------------#
print "Welcom to Python!"


# 1.2--------------------------------------------------------------------------#
my_variable = 10
spam = 5

# 1.3--------------------------------------------------------------------------#
my_int = 7
my_float = 1.23
my_bool = True

# 1.4--------------------------------------------------------------------------#
# 아래에 변수 my_int의 값은 7로 지정되어 있습니다.
# 지정된 값을 3으로 변경하고 결과를 출력하려면 어떻게 해야할까요?

my_int = 7

# 여덟 번째 줄에서 변수 my_int의 값을 3 으로 변경하세요!

my_int = 3

# 변수 my_int의 값을 console에 출력하는 코드는 아래와 같습니다:
# 여기서 사용된 print 키워드는 이후 더 자세히 다룰 예정입니다!

print my_int

# 1.5--------------------------------------------------------------------------#
def spam():
eggs = 12
return eggs

print spam()

 File "python", line 2
    eggs = 12
       ^
IndentationError: expected an indented block

# 1.6--------------------------------------------------------------------------#
def spam():
    eggs = 12
    return eggs

print spam()

# 1.7--------------------------------------------------------------------------#
spam = True
eggs = False

# 1.8--------------------------------------------------------------------------#
# 주석
mysterious_variable = 42

# 1.9--------------------------------------------------------------------------#
""" 주석1번줄
주석 2번줄
주석 3번줄 """

# 1.10-------------------------------------------------------------------------#
# 세 번째 줄에서 변수 count_to의 값으로 1 더하기 2를 지정하세요!
count_to = 1 + 2

print count_to

# 1.11-------------------------------------------------------------------------#
# 세 번째 줄에서 거듭제곱을 이용하여 변수 eggs의 값을 100으로 지정하세요!

eggs = 100 ** 1

print eggs

# 1.12-------------------------------------------------------------------------#
# 세 번째 줄에서 모듈로 연산을 이용하여 변수 spam의 값을 1로 지정하세요!

spam = 5 % 2

print spam

# 1.13-------------------------------------------------------------------------#
# 주석 1번줄
monty = True
python = 1.234
monty_python = python ** 2
